tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"
tap "ngrok/ngrok"

brew "coreutils"
brew "fish"
brew "git"
brew "git-lfs"
brew "diffutils"
brew "n"
brew "asdf"
brew "yarn"
brew "bat"
brew "eza"
brew "jq"
brew "openjdk@11"
brew "python@3.11"
brew "hashicorp/tap/terraform"
brew "terminal-notifier"
brew "watchman"

cask "iterm2"
cask "visual-studio-code"
cask "arc"
cask "orbstack"
cask "raycast"
cask "android-studio"
cask "syncalicious"
cask "dozer"
cask "witch"
cask "commandq"
cask "meetingbar"
cask "scroll-reverser"
cask "obsidian"
cask "ngrok"
cask "telegram"
cask "zoom"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"
cask "google-cloud-sdk"

vscode "teabyii.ayu"
vscode "wayou.vscode-todo-highlight"
vscode "ms-vscode.sublime-keybindings"
vscode "streetsidesoftware.code-spell-checker"
vscode "eamodio.gitlens"
vscode "SimonSiefke.svg-preview"
vscode "antfu.browse-lite"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "styled-components.vscode-styled-components"
vscode "csstools.postcss"
vscode "vunguyentuan.vscode-postcss"
vscode "bradlc.vscode-tailwindcss"
vscode "ChFlick.firecode"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql-syntax"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "svelte.svelte-vscode"
